<?php
/**
 * Created by PhpStorm.
 * User: pc
 * Date: 07.01.2018
 * Time: 23:22
 */

return
    [
        'mysql_title' => 'Это пример взаимодействия с базой данных посредством Eloquent ORM',
        'mti_1' => 'Вы можете добавить записи в таблицу базы данных вручную, используя форму ниже (нажмите <b>Создать пользователя</b>)
или загрузить тестовые данные нажатием на кнопку "Загрузка тестовых данных"! Тестовые данные загружаються с помощью Seed класса. Поля таблицы, 
такие как "Name", "Surname" заполняются данными из соответствующих массивов в случайном порядке. Поле "Age" - случайное целочисленное число
в диапазоне от 18 до 99.'

    ];