<?php
/**
 * Created by PhpStorm.
 * User: pc
 * Date: 07.01.2018
 * Time: 23:22
 */

return
    [
        'title' => 'Учебный Laravel',
        //PHP
        'ser_time' => 'Серверное время',
        'pti_1' => 'Это страница с простыми действиями над данными с использованием <b>Php</b> функций.
        Например, вы можете ввести некоторые числа или буквы в поле ниже и нажать <b>Массив</b>. Введенная строка будет преобразована
        в массив.',
        'pti_2' => '<i>Введите числа и (или) буквы через пробел, запятую или точку и нажмите <b>Массив</b></i>',
        'p_array' => 'Массив',
        'pti_3' => '<i>Также вы можете нажать на ссылку <b>Файл</b>, чтобы перейти на страницу для работы с тестовым файлом. 
Там вы сможете выполнить некоторые действия над файлом и его содержимым</i>',
        'en_data' => 'Введенные данные',
        'ct_arr' => 'Преобразование в массив',
        'arr_sort' => 'Сортировка массива',
        'rarr_sort' => 'Обратная сортировка массива',
        'arr_shuf' => 'Перемешивание массива',
        'f_elem' => 'Первый элемент массива',
        'l_elem' => 'Последний элемент массива',
        'swap' => 'Замена местами ключей и значений',
        'combine' => 'Объединение элементов массива <b><i>Перемешивание массива</i></b> в строку',
        'edfile' => 'Файл',
        'filecont' => 'Содержимое тестового файла',
        'fti_1' => 'Вы можете отредактировать содержимое тестового файла в поле ниже (нажмите<b> Редактировать содержимое </b>)',
        'fti_2' => 'В этом поле вы можете отредактировать содержимое тестового файла',
        'fti_3' => 'Для проверки результата, вы можете скачать тестовый файл до вненсения изменений, а затем после, и сравнить их. Скачать',
        'here' => 'здесь',
        'save' => 'Сохранить изменения',
        'edcont' => 'Редактировать содержимое',

        //MySQL
        'mysql_title' => 'Это пример взаимодействия с базой данных посредством Eloquent ORM',
        'mti_1' => 'Вы можете добавить записи в таблицу базы данных вручную, используя форму ниже (нажмите <b>Создать пользователя</b>)
или загрузить тестовые данные нажатием на кнопку "Загрузка тестовых данных"! Тестовые данные загружаються с помощью Seed класса. Поля таблицы, 
такие как "Name", "Surname" заполняются данными из соответствующих массивов в случайном порядке. Поле "Age" - случайное целочисленное число
в диапазоне от 18 до 99.',
        'ltdata' => 'Загрузка тестовых данных',
        'cr_usr' => 'Создать пользователя',
        'name' => 'Имя',
        'surname' => 'Фамилия',
        'age' => 'Возраст',
        'add_usr' => 'Добавить пользователя',
        'mti_2' =>'Вы можете выполнять некоторые простые действия над записями в таблице базы данных, такие как <b><i>удаление</i></b>, 
<b><i>редактирование</i></b> и <b><i>групповое удаление</i></b>. Также, если вы пожелаете, можете очистить таблицу полностью, нажав кнопку
<b><i>Очистить таблицу</i></b>',
        'mti_3' =>'Это действие удалит все записи из таблицы и сбросит авто-инкрементное поле ID в ноль. Все равно хотите продолжить?',
        'doreg' => 'Дата регистрации',
        'actions' => 'Действия',
        'sel_all' => 'Выбрать все',
        'del_sel_gr' => 'Удалить выбранные записи',
        'clr_tbl' => 'Очистить таблицу',
        'confirm_del' => 'Вы уверены?',
        'close' => 'Закрыть',
        'del_rec' => 'Удалить запись',
        'search' => 'Поиск',
        'test data was loaded successfully!!!' => 'Тестовые данные загружены успешно!!!',
        'User' => 'Пользователь',
        'has been updated successful!' => 'успешно обновлен!',
        'has been deleted successful!' => 'успешно удален!',
        'has been added successful!' => 'успешно добавлен',
        'User has been added successful!' => 'Пользователь успешно добавлен!',
        'All records have been successfully deleted!' => 'Все записи успешно удалены!',
        'Users group has been deleted successful!' => 'Группа пользователей успешно удалена!',

        //Ajax
        'a_gdat' => 'Получить данные из базы данных с помощью ajax запроса',
        'ait_1' => 'Нажатие на кнопку <i><b>Получить данные</b></i> отправит ajax запрос к базе данных для извлечения всех записей.',
        'get_data' => 'Получить данные',
        'data_strg' => 'Сохранение данных в базу данных посредством ajax',
        'ati_2' => 'В форме, представленной ниже, (нажмите <i><b>Создать пользователя</b></i>) вы можете добавлять пользователей в базу данных ajax запросами',

    ];