<?php
/**
 * Created by PhpStorm.
 * User: pc
 * Date: 07.01.2018
 * Time: 23:22
 */

return
    [
        //PHP
        'ser_time' => 'Серверное время',
        //MySQL
        'mysql_title' => 'Это пример взаимодействия с базой данных посредством Eloquent ORM',
        'mti_1' => 'Вы можете добавить записи в таблицу базы данных вручную, используя форму ниже (нажмите <b>Создать пользователя</b>)
или загрузить тестовые данные нажатием на кнопку "Загрузка тестовых данных"! Тестовые данные загружаються с помощью Seed класса. Поля таблицы, 
такие как "Name", "Surname" заполняются данными из соответствующих массивов в случайном порядке. Поле "Age" - случайное целочисленное число
в диапазоне от 18 до 99.',
        'ltdata' => 'Загрузка тестовых данных',
        'cr_usr' => 'Создать пользователя',
        'name' => 'Имя',
        'surname' => 'Фамилия',
        'age' => 'Возраст',
        'add_usr' => 'Добавить пользователя',
        'mti_2' =>'Вы можете выполнять некоторые простые действия над записями в таблице базы данных, такие как <b><i>удаление</i></b>, 
<b><i>редактирование</i></b> и <b><i>групповое удаление</i></b>. Также, если вы пожелаете, можете очистить таблицу полностью, нажав кнопку
<b><i>Очистить таблицу</i></b>',
        'doreg' => 'Дата регистрации',
        'actions' => 'Действия',
        'sel_all' => 'Выбрать все',
        'del_sel_gr' => 'Удалить выбранные записи',
        'clr_tbl' => 'Очистить таблицу',
        'confirm_del' => 'Вы уверены?',
        'close' => 'Закрыть',
        'del_rec' => 'Удалить запись',
        'search' => 'Поиск',

    ];